{
  "onion": "Store onions in a cool, dry place to increase shelf life.",
  "cotton": "Apply fertilizer after rainfall for better yield in cotton.",
  "soybean": "Ensure well-drained soil to prevent soybean root rot.",
  "wheat": "Harvest wheat when the grains are hard and moisture is low.",
  "sugarcane": "Regular irrigation improves sugarcane sweetness.",
  "coconut": "Provide adequate nutrients for healthy coconut trees.",
  "rice": "Maintain proper water management for optimal rice yield.",
  "maize": "Proper fertilization and weed control boost Maize yield.",
  "papaya": "Papaya plants require consistent watering.",
  "chilli": "Ensure good air circulation to prevent diseases in Chilli.",
  "grapes": "Prune grapevines annually for optimal fruit production.",
  "pomegranate": "Prune pomegranate trees regularly for better fruit quality.",
  "jowar": "Early pest detection is important for Jowar crop health.",
  "ginger": "Ginger thrives in partial shade and well-drained soil.",
  "banana": "Regular desuckering enhances banana productivity.",
  "sweet_corn": "Sweet corn needs plenty of sunlight and consistent moisture.",
  "paddy_": "General tip for paddy_: Ensure proper soil and timely care.",
  "gram_(chana)": "General tip for gram_(chana): Ensure proper soil and timely care.",
  "cabbage": "Cabbage needs consistent moisture for head development.",
  "watermelon": "Watermelon needs consistent moisture, especially during fruiting.",
  "linseed": "Linseed benefits from early planting and adequate moisture.",
  "orange": "Monitor soil moisture to prevent fruit drop in Oranges.",
  "tendu_leaves": "Harvest Tendu leaves carefully to ensure quality.",
  "brinjal": "Monitor Brinjal plants for pest infestations regularly.",
  "potato": "Plant potatoes in loose, well-drained soil.",
  "bajra": "Bajra thrives in well-drained sandy loam soils.",
  "sweet_orange_(mosambi)": "General tip for sweet_orange_(mosambi): Ensure proper soil and timely care.",
  "mango": "Mango trees require regular pruning and adequate sunlight for better fruiting.",
  "tomato": "Stake or cage tomato plants for better fruit development.",
  "sapota_(chikoo)": "General tip for sapota_(chikoo): Ensure proper soil and timely care.",
  "tur": "Timely sowing and pest control are crucial for Tur.",
  "turmeric": "Turmeric requires rich, well-drained loamy soils.",
  "jaggery": "Proper storage is essential for maintaining jaggery quality.",
  "kokum": "Kokum trees prefer humid climates and rich soil.",
  "groundnut": "Groundnuts need sandy loam soil and proper moisture.",
  "cashew_nut": "Cashew nuts thrive in warm, humid climates with well-drained soil."
}